validation/restartContinuity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    restartContinuity: continuous vs restarted run. The case itself is a
    thin donor of a stateful problem (lumped mould temperature + stage
    fields); the verifier runs it a second time in two stages and compares.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          moldingFoam;

libs            ("libmoldingFoam.so");

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.02;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable no;

adjustTimeStep  off;

functions
{
    moldTemperature
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     no;
        log             true;
        patch           coldWall;
        operation       areaAverage;
        fields          (T);
    }
}

// ************************************************************************* //
