validation/restartContinuity/system/expectedPatterns
moldingFoam: read .*moldingDict
End
