validation/restartContinuity/system/verifier
verify-restart-continuity.py
